snlkuharlocal/src/InformationRegisters/НастройкиОбъектов/НастройкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбъектов</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/НастройкиОбъектов/ManagerModule.bsl
Функция ПолучитьНастройку(СтруктураНастройки) Экспорт
	
	Если ТипЗнч(СтруктураНастройки) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиОбъектов.Пользователь КАК Пользователь,
	|	НастройкиОбъектов.ТипОбъекта КАК ТипОбъекта,
	|	НастройкиОбъектов.ИмяОбъекта КАК ИмяОбъекта,
	|	НастройкиОбъектов.ИмяНастройки КАК ИмяНастройки,
	|	НастройкиОбъектов.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
	|ГДЕ
	|	НастройкиОбъектов.ИмяОбъекта = &ИмяОбъекта
	|	И НастройкиОбъектов.Пользователь = &Пользователь
	|	И НастройкиОбъектов.ИмяНастройки = &ИмяНастройки
	|	И НастройкиОбъектов.ТипОбъекта = &ТипОбъекта");
	
	Если СтруктураНастройки.Свойство("Пользователь") Тогда
		Запрос.УстановитьПараметр("Пользователь", СтруктураНастройки.Пользователь);
	Иначе
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ТипОбъекта", СтруктураНастройки.ТипОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", СтруктураНастройки.ИмяОбъекта);
	Запрос.УстановитьПараметр("ИмяНастройки", СтруктураНастройки.ИмяНастройки);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		СтруктураНастройки.Вставить("ЗначениеНастройки", ВыборкаИзРезультатаЗапроса.ЗначениеНастройки.Получить());
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПолучитьНастройку()

Функция ПолучитьНастройки(СтруктураНастройки, ПолучитьНастройкиВсехПользователей = Ложь, ПолучитьГрупповыеНастройки = Ложь, ПолучитьОбщиеНастройки = Ложь) Экспорт
	
	Если ТипЗнч(СтруктураНастройки) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиОбъектов.Пользователь КАК Пользователь,
	|	НастройкиОбъектов.ТипОбъекта КАК ТипОбъекта,
	|	НастройкиОбъектов.ИмяОбъекта КАК ИмяОбъекта,
	|	НастройкиОбъектов.ИмяНастройки КАК ИмяНастройки,
	|	НастройкиОбъектов.ЗначениеНастройки КАК ЗначениеНастройки,
	|	0 КАК ВидНастройки
	|ИЗ
	|	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
	|ГДЕ
	|	НастройкиОбъектов.ИмяОбъекта = &ИмяОбъекта
	|	И НастройкиОбъектов.ТипОбъекта = &ТипОбъекта
	|	И НастройкиОбъектов.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиОбъектов.Пользователь,
	|	НастройкиОбъектов.ТипОбъекта,
	|	НастройкиОбъектов.ИмяОбъекта,
	|	НастройкиОбъектов.ИмяНастройки,
	|	НастройкиОбъектов.ЗначениеНастройки,
	|	1
	|ИЗ
	|	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
	|ГДЕ
	|	НастройкиОбъектов.ИмяОбъекта = &ИмяОбъекта
	|	И НастройкиОбъектов.ТипОбъекта = &ТипОбъекта
	|	И НастройкиОбъектов.Пользователь <> &Пользователь
	|	И НастройкиОбъектов.Пользователь ССЫЛКА Справочник.Пользователи
	|	И &НастройкиВсехПользователей = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиОбъектов.Пользователь,
	|	НастройкиОбъектов.ТипОбъекта,
	|	НастройкиОбъектов.ИмяОбъекта,
	|	НастройкиОбъектов.ИмяНастройки,
	|	НастройкиОбъектов.ЗначениеНастройки,
	|	2
	|ИЗ
	|	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
	|ГДЕ
	|	НастройкиОбъектов.ИмяОбъекта = &ИмяОбъекта
	|	И НастройкиОбъектов.ТипОбъекта = &ТипОбъекта
	|	И НастройкиОбъектов.Пользователь = НЕОПРЕДЕЛЕНО
	|	И &ОбщиеНастройки = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидНастройки,
	|	ИмяНастройки");
			
	Если СтруктураНастройки.Свойство("Пользователь") И ЗначениеЗаполнено(СтруктураНастройки.Пользователь) Тогда
		Запрос.УстановитьПараметр("Пользователь", СтруктураНастройки.Пользователь);
	Иначе
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ТипОбъекта", СтруктураНастройки.ТипОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", СтруктураНастройки.ИмяОбъекта);
	Запрос.УстановитьПараметр("НастройкиВсехПользователей", ПолучитьНастройкиВсехПользователей);
	Запрос.УстановитьПараметр("ГрупповыеНастройки", ПолучитьГрупповыеНастройки);
	Запрос.УстановитьПараметр("ОбщиеНастройки", ПолучитьОбщиеНастройки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьНастройки()
	
Функция СохранитьСтандартнуюНастройку(СтруктураНастройки, СтруктураЗаменяемойНастройки = Неопределено) Экспорт
	
	Если ТипЗнч(СтруктураНастройки) <> Тип("Структура") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НастройкиОбъектов.СоздатьМенеджерЗаписи();
		
	Если СтруктураЗаменяемойНастройки <> Неопределено Тогда
		
		МенеджерЗаписи.Пользователь = СтруктураЗаменяемойНастройки.Пользователь;
		МенеджерЗаписи.ТипОбъекта = СтруктураЗаменяемойНастройки.ТипОбъекта;
		МенеджерЗаписи.ИмяОбъекта = СтруктураЗаменяемойНастройки.ИмяОбъекта;
		МенеджерЗаписи.ИмяНастройки = СтруктураЗаменяемойНастройки.ИмяНастройки;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			Если СтруктураЗаменяемойНастройки.Свойство("ЗначениеНастройки") Тогда
				
				МенеджерЗаписи.ЗначениеНастройки = Новый ХранилищеЗначения(СтруктураЗаменяемойНастройки.ЗначениеНастройки, Новый СжатиеДанных(9));
				
			КонецЕсли;
				
		Иначе
				
			Возврат Ложь;
				
		КонецЕсли;
		
	Иначе
		
		МенеджерЗаписи.Пользователь = СтруктураНастройки.Пользователь;
		МенеджерЗаписи.ТипОбъекта = СтруктураНастройки.ТипОбъекта;
		МенеджерЗаписи.ИмяОбъекта = СтруктураНастройки.ИмяОбъекта;
		МенеджерЗаписи.ИмяНастройки = СтруктураНастройки.ИмяНастройки;
		МенеджерЗаписи.ЗначениеНастройки = Новый ХранилищеЗначения(СтруктураНастройки.ЗначениеНастройки, Новый СжатиеДанных(9));
		
	КонецЕсли;
	
	МенеджерЗаписи.ДатаМодификации = ТекущаяДата();
	
	МенеджерЗаписи.Записать();
		
	Возврат Истина;
	
КонецФункции // СохранитьСтандартнуюНастройку()

Функция УдалитьНастройку(СтруктураНастройки) Экспорт
	
	Если ТипЗнч(СтруктураНастройки) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НастройкиОбъектов.СоздатьМенеджерЗаписи();
		
	МенеджерЗаписи.Пользователь = СтруктураНастройки.Пользователь;
	МенеджерЗаписи.ТипОбъекта = СтруктураНастройки.ТипОбъекта;
	МенеджерЗаписи.ИмяОбъекта = СтруктураНастройки.ИмяОбъекта;
	МенеджерЗаписи.ИмяНастройки = СтруктураНастройки.ИмяНастройки;
	
	МенеджерЗаписи.Прочитать();
		
	Если МенеджерЗаписи.Выбран() Тогда
			
		МенеджерЗаписи.Удалить();
			
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // УдалитьНастройку()

//////////////////////////////////////////////////////////////////////////////////////

Функция ВосстановлениеНастроек(СтруктураНастройки) Экспорт
	
	ФормаУправленияНастройками = РегистрыСведений.НастройкиОбъектов.ПолучитьФорму("ФормаУправленияНастройками");
	ФормаУправленияНастройками.мВосстановлениеНастройки = Истина;
	ФормаУправленияНастройками.мСтруктураНастройки = СтруктураНастройки;
	
	Результат = ФормаУправленияНастройками.ОткрытьМодально();
	Возврат Результат;
	
КонецФункции // ВосстановлениеНастроек()

Функция СохранениеНастроек(СтруктураНастройки) Экспорт
	
	ФормаУправленияНастройками = РегистрыСведений.НастройкиОбъектов.ПолучитьФорму("ФормаУправленияНастройками");
	ФормаУправленияНастройками.мВосстановлениеНастройки = Ложь;
	ФормаУправленияНастройками.мСтруктураНастройки = СтруктураНастройки;
	
	Результат = ФормаУправленияНастройками.ОткрытьМодально();
	Возврат Результат;
	
КонецФункции // СохранениеНастроек()
